app/controllers/products_controller.rb

	def create
		@product = Product.new(product_params)
		@product.user = current_user
		if @product.save
---
INSERT INTO "products" ("created_at", "updated_at", "product_name", "price", "stock", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2019-08-11 06:28:53.732763"], ["updated_at", "2019-08-11 06:28:53.732763"], ["product_name", "グリップ"], ["price", 1000], ["stock", 1], ["user_id", 1]]

	def purchase
		@product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def purchase_confirm
		@product = Product.find(params[:id])
		@product.update(purchase: true, purchased_at: Time.current)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "purchase" = ?, "purchased_at" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["purchase", 1], ["purchased_at", "2019-08-11 06:29:12.141302"], ["updated_at", "2019-08-11 06:29:12.252841"], ["id", 2]]